cask_args appdir: "/Applications"

tap "aws/tap"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "leoafarias/fvm"
tap "sanemat/font"
tap "stripe/stripe-cli"

brew "anyenv"
brew "aws-sam-cli"
brew "awsume"
brew "bash-completion"
brew "bat"
brew "blueutil"
brew "cfn-lint"
brew "cmatrix"
brew "cocoapods"
brew "docker"
brew "eslint"
brew "exa"
brew "gh"
brew "git"
brew "git-flow"
brew "git-secrets"
brew "gitmoji"
brew "gmp"
brew "go"
brew "gtop"
brew "hadolint"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "kubernetes-cli"
brew "leoafarias/fvm/fvm"
brew "libgit2"
brew "libssh2"
brew "libyaml"
brew "lolcat"
brew "mas"
brew "mysql"
brew "neofetch"
brew "node"
brew "nodebrew"
brew "nodenv"
brew "openssl@1.1"
brew "pre-commit"
brew "pyenv"
brew "pylint"
brew "rbenv"
brew "readline"
brew "redis"
brew "ricty"
brew "rsync"
brew "ruby-build"
brew "serverless"
brew "shellcheck"
brew "sl"
brew "sleepwatcher"
brew "stripe/stripe-cli/stripe"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "tree"
brew "vim"
brew "volta"
brew "watch"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"

cask "adobe-creative-cloud"
cask "appcleaner"
cask "aws-vault"
cask "cheatsheet"
cask "deepl"
cask "discord"
cask "docker"
cask "fig"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "keyboardcleantool"
cask "kindle"
cask "ngrok"
cask "postman"
cask "rancher"
cask "raycast"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "warp"
cask "zoom"

mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Twitter", id: 1482454543
